//dart 3.0的元组 Records类型(元素1,元素2,元素3...) (swift中的元组),小括号里面可以是任意类型
main() {

  /*
  Record r = (123, 456);
  print("r类型=${r.runtimeType}");
  //类型注释(类型,类型),例如(int, int)
  //Record类型注释是由括在括号中的类型的逗号分隔列表组成。您可以使用record类型注释来定义返回类型和参数类型。
  (int, int) r1 = (123, 456);
  //$1,$2分别对应元祖的第一个和第二个位置的值,这里的1和2是位置字段
  print(r1.$1); //$1代表位置字段1的值
  print(r1.$2);
  var r2 = (123, 456);

  //a,b是命名字段,$1,$2是位置字段
  var r3 = (a: 100, b: 200, 300, 400);
  r3.a;
  r3.b;
  r3.$1;
  r3.$2;
  //命名字段,不能乱起名字
  // var r4 = (1:100,b:200,300,400);//报错

  //带命名字段的 类型注释 语法:用 {}大括号把命名字段括起来,例如下面{}里面的命名字段a和b
  ({int a, int b}) r5;
  r5 = (a: 100, b: 200);
  // ({int a, int b})

  //在record类型注释中，您还可以为位置字段命名，但是这些名称仅用于文档，不影响record的类型：
  (int age, int money) r6 = (100, 200);
  r6.$1;
  r6.$2;

  //命名字段不一样不能赋值
  ({int c, int d}) r7 = (c: 100, d: 200);
  // r5 = r7;
  ({int a, int b}) r8 = (a: 111, b: 222);
  r5 = r8;
  print(r5);


  // Record相等性
  // 如果两个records具有相同的形状（字段集合）并且它们对应的字段具有相同的值，则它们相等。
  //位置字段命名以后,不影响判断值
  ({int a,int b})r9 = (a:100,b:200);
  ({int a,int b})r10 = (a:100,b:200);
  print(r9==r10);

  (int age,int money) r11 = (100,200);
  (int age2,int money2) r12 = (100,200);
  print(r11==r12);//位置字段命名以后,不影响判断值

  //解构Destructuring
  //解构:像swift中的元组那样使用, 把()小括号里面对应的位置,放上变量进行接收
  //解构在后续的模式课程中会详细讲解:解构是用一组变量,去分解相同形状的一组值.
   var (a,b) =  (100,200);
  var (a2,_) =  (100,200);//解构不需要的变量,可以用下划线忽略
   print(a);
  // print(b);

//简单练习一下解构 用在List中
var l1 = [1,2,3,4];
int x1,x2,x3;
 [x1,x2,x3,_] = l1;
 print("$x1 $x2 $x3");


//解构 用在Map中
     var {"money":y1,"age":y2} =  {"money":10000,"age":18};
     print("$y1 $y2");
*/
  //record的多返回值,通过解构来完成
     (String,int) userInfo(){
            return ("张三",18);
     }
     var (name,age )= userInfo();
      print("$name   $age");
}
