/*
[]位置可选参数 ,[]中括号里面的参数顺序不能换,因为[]中括号中的参数是可以不传入的,所以必须是可选类型,或者给默认值
{}命名可选参数,{}大括号里面的参数名字必须传入,位置可以换,有required关键字作为必填项,不能有默认值,因为一定会传入
required的精髓就是,可以在调用的时候自动填写出参数名,但是如果不填写required不会自动填写参数名,因为参数也可能是程序员自己故意不填写的
 */

fun1(int a, [int? b, int? c]) {
  print("a= $a b=$b c=$c"); //不传入值的话,默认是null
}

fun2(int a, [int b = 888, int c = 999]) {
  print("a= $a b=$b c=$c"); //不传入值的话,有默认值
}
// fun3(int a, [int b , int c ]) {  //报错,因为位置可选参数可以不传入值,不传入值,默认是空,空的话,必须用可选类型接收.
//   print("a= $a b=$b c=$c"); //不传入值的话,有默认值
// }


//命名可选参数调用的时候必须有参数名字
fun4(int a,{int? b,int? c}){
  print("a= $a b=$b c=$c");
}
fun5(int a,{int? b = 888,int? c = 999}){ //可以有默认值 ,注意dart3.0以后默认值改成了用 = 而不是 冒号:
  print("a= $a b=$b c=$c");
}

fun6(int a,{required int? b ,required int c }){ //required必填项,调用的时候必须传入值,因为是必填项,所以可以不是可选类型
  print("a= $a b=$b c=$c");
}
// fun7(int a,{required int? b =100 ,required int c }){ //required必填项,所以不能有默认值,因为一定会传入值
//   print("a= $a b=$b c=$c");
// }
main() {
  fun1(100);
  fun2(200);
  fun1(100, 200, 300); //参数位置顺序不能改变,改变了函数也不知道

  fun4(100, b: 200, c: 300); //命名可选参数调用的时候必须有参数名字
  fun4(100, c: 200, b: 500); //位置顺序可以改变,因为有参数名字,所以编译器能找到对应的参数
  fun5(100); //因为有默认值,所以不传参数也有默认值
  fun6(100, b: null, c: 100);
}
